In [1]:
from pandas import Series , DataFrame

In [16]:
import pandas as pd
import numpy as np

# Series

In [3]:
obj=Series([3,-5,3,7])
print(obj)

0    3
1   -5
2    3
3    7
dtype: int64

In [4]:
obj.values

array([ 3, -5,  3,  7], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2=Series([4,5,6,7],index=['d','e','a','b'])
obj2

d    4
e    5
a    6
b    7
dtype: int64

In [9]:
obj2.index

Index(['d', 'e', 'a', 'b'], dtype='object')

In [10]:
obj2['a']

6

In [12]:
obj2[['d','a','e']]

d    4
a    6
e    5
dtype: int64

In [13]:
obj2['a']=9
obj2

d    4
e    5
a    9
b    7
dtype: int64

In [14]:
obj2[obj2 > 5]

a    9
b    7
dtype: int64

In [15]:
obj2*2

d     8
e    10
a    18
b    14
dtype: int64

In [17]:
np.exp(obj)

0      20.085537
1       0.006738
2      20.085537
3    1096.633158
dtype: float64

In [18]:
'b' in obj2

True

In [19]:
'z' in obj2

False

In [21]:
#Dict to Series conversion
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
#List To Series
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4=Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [32]:
obj4.name='population'

In [33]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [34]:
obj4.index.name='state'

In [35]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [36]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [37]:
obj

Bob      3
Steve   -5
Jeff     3
Ryan     7
dtype: int64

# DataFrame

In [38]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame=DataFrame(data)

In [39]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [40]:
DataFrame(data,columns=['state','year','pop'])

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [42]:
frame2=DataFrame(data,columns=['state','year','pop','dept'],
                index=['one','two','three','four','five'])
frame2

        state  year  pop dept
one      Ohio  2000  1.5  NaN
two      Ohio  2001  1.7  NaN
three    Ohio  2002  3.6  NaN
four   Nevada  2001  2.4  NaN
five   Nevada  2002  2.9  NaN

In [43]:
frame2.columns

Index(['state', 'year', 'pop', 'dept'], dtype='object')

In [46]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [47]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [51]:
frame2.loc['three']

state    Ohio
year     2002
pop       3.6
dept      NaN
Name: three, dtype: object

In [52]:
frame2['dept']=16.2

In [53]:
frame2

        state  year  pop  dept
one      Ohio  2000  1.5  16.2
two      Ohio  2001  1.7  16.2
three    Ohio  2002  3.6  16.2
four   Nevada  2001  2.4  16.2
five   Nevada  2002  2.9  16.2

In [68]:
frame2['dept']=range(5)

In [69]:
frame2

        state  year  pop  dept
one      Ohio  2000  1.5     0
two      Ohio  2001  1.7     1
three    Ohio  2002  3.6     2
four   Nevada  2001  2.4     3
five   Nevada  2002  2.9     4

In [58]:
val=Series([1.2,2.5,4.3],index=['two','four','five'])

In [59]:
frame2['dept']=val

In [60]:
frame2

        state  year  pop  dept
one      Ohio  2000  1.5   NaN
two      Ohio  2001  1.7   1.2
three    Ohio  2002  3.6   NaN
four   Nevada  2001  2.4   2.5
five   Nevada  2002  2.9   4.3

In [63]:
frame2['estern']=frame2.state=='Ohio'

In [64]:
frame2

        state  year  pop  dept  estern
one      Ohio  2000  1.5   NaN    True
two      Ohio  2001  1.7   1.2    True
three    Ohio  2002  3.6   NaN    True
four   Nevada  2001  2.4   2.5   False
five   Nevada  2002  2.9   4.3   False

In [65]:
del frame2['estern']

In [67]:
frame2.columns

Index(['state', 'year', 'pop', 'dept'], dtype='object')

In [71]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [72]:
frame3 = DataFrame(pop)

In [73]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [74]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [75]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [77]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [80]:
frame3['Ohio'][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [81]:
frame3['Nevada'][:2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [82]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [83]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [84]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [85]:
frame2.values

array([['Ohio', 2000, 1.5, 0],
       ['Ohio', 2001, 1.7, 1],
       ['Ohio', 2002, 3.6, 2],
       ['Nevada', 2001, 2.4, 3],
       ['Nevada', 2002, 2.9, 4]], dtype=object)